#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОчиститьИНастроитьДиаграмму(Диаграмма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Диаграмма.Очистить();
	Элементы.ДиаграммаТаблица.Обновить();
	ПодключитьОбработчикОжидания("СформироватьНаДиаграмму", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаДиаграмму()
	
	СформироватьНаСервере();
	Элементы.ДиаграммаТаблица.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПериода", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
	Диалог.Показать(ОписаниеВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборПериода(ВыбранныйПериод, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныйПериод <> Неопределено Тогда
		НачалоПериода = ВыбранныйПериод.ДатаНачала;
		КонецПериода  = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Перем ТочкаРЗ;
	
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	
	СерияРабочее = Диаграмма.УстановитьСерию("Рабочие потоки");
	СерияРабочее.Цвет = WebЦвета.СинийСПороховымОттенком;
	
	СерияУправляющее = Диаграмма.УстановитьСерию("Управляющее ФЗ");
	СерияУправляющее.Цвет = WebЦвета.СинийСоСтальнымОттенком;
	
	СерияРЗ = Диаграмма.УстановитьСерию("Регламентные задания");
	СерияРЗ.Цвет = WebЦвета.Сливовый;
	
	ТаблицаДанных = ДанныеДляДиаграммы();
	
	МинДатаГанта = Неопределено;
	МаксДатаГанта = 0;
	
	КэшОкончанийДорожек = Новый Соответствие;
	КэшТочекУправляющих = Новый Соответствие;
	КэшСпособов         = Новый Соответствие;
	КэшУправляющихФЗ    = Новый Соответствие;
	КэшРЗ               = Новый Соответствие;
	
	ВидРабочее     = Перечисления.ум_ВидыФЗПакетовДанных.РабочееФЗ;
	ВидУправляющее = Перечисления.ум_ВидыФЗПакетовДанных.УпровляющееФЗ;
	ВидРЗ          = Перечисления.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеОбработкаПакетов;
	
	Цвета = ПолучитьЦветаИнтервала();
	ИндексЦвета = 0;
	
	СтрокиРЗ = ТаблицаДанных.НайтиСтроки(Новый Структура("ВидФЗ", ВидРЗ));
	СчетчикРЗ = 0;
	
	Для Каждого СтрокаРЗ Из СтрокиРЗ Цикл
		
		Если ТочкаРЗ = Неопределено Тогда
			ТочкаРЗ = Диаграмма.УстановитьТочку("Регламентное задание обработка пакетов");
			ТочкаРЗ.Текст = "Регламентное задание обработка пакетов";
		КонецЕсли;
		
		ДатаОкончания = 0;
		ОбновитьГраницыВремени(СтрокаРЗ, МинДатаГанта, МаксДатаГанта, ДатаОкончания);
		ИмяСпособа = СтрокаРЗ.СпособОбработкиПакетовПредставление;
		
		Если СтрокаРЗ.ЭтоПустоеРЗ Тогда
			ЦветИнтервала = WebЦвета.Черный;
		Иначе
			ЦветИнтервала = Цвета[ИндексЦвета];
			КэшРЗ.Вставить(СтрокаРЗ.КлючРабочегоПотока, ЦветИнтервала);
			ИндексЦвета = ИндексЦвета + 1;
		КонецЕсли;
		
		Текст = СтрокаРЗ.ОбработаноПакетов;
		ДобавитьИнтервалДиаграммы(Диаграмма, ТочкаРЗ, СерияРЗ, СтрокаРЗ.ВременнаяМеткаНачало, ДатаОкончания, ЦветИнтервала, Текст);
		
		СчетчикРЗ = СчетчикРЗ + 1;
		Если ИндексЦвета = Цвета.Количество() Тогда
			ИндексЦвета = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиУправляющих = ТаблицаДанных.НайтиСтроки(Новый Структура("ВидФЗ", ВидУправляющее));
	СчетчикУправляющих = 0;
	
	Для Каждого СтрокаУправляющего Из СтрокиУправляющих Цикл
		
		ДатаОкончания = 0;
		ОбновитьГраницыВремени(СтрокаУправляющего, МинДатаГанта, МаксДатаГанта, ДатаОкончания);
		ИмяСпособа = СтрокаУправляющего.СпособОбработкиПакетовПредставление;
		
		ИмяУправляющего = ИмяСпособа + " (Управляющее ФЗ)"; 
		ИДСпособаОбработки = XmlСтрока(СтрокаУправляющего.СпособОбработки);
		
		ЦветИнтервала = КэшРЗ.Получить(СтрокаУправляющего.ИдентификаторРодительскогоФЗ);
		КэшУправляющихФЗ.Вставить(, ЦветИнтервала);
		
		ТочкаУправл = Диаграмма.УстановитьТочку(ИДСпособаОбработки, ТочкаРЗ.Значение);
		ТочкаУправл.Текст = ИмяУправляющего;
		ИнформацияФЗ = Новый Структура("Точка, Цвет", ТочкаУправл, ЦветИнтервала);
		КэшУправляющихФЗ.Вставить(СтрокаУправляющего.КлючРабочегоПотока, ИнформацияФЗ);
		
		Текст = СтрокаУправляющего.ОбработаноПакетов;
		ДобавитьИнтервалДиаграммы(Диаграмма, ТочкаУправл, СерияУправляющее, СтрокаУправляющего.ВременнаяМеткаНачало, ДатаОкончания, ЦветИнтервала, Текст);
		
	КонецЦикла;
	
	СтрокиРабочих = ТаблицаДанных.НайтиСтроки(Новый Структура("ВидФЗ", ВидРабочее));
	
	Для Каждого СтрокаРабочего Из СтрокиРабочих Цикл
		
		ДатаОкончания = 0;
		ОбновитьГраницыВремени(СтрокаРабочего, МинДатаГанта, МаксДатаГанта, ДатаОкончания);
		ИмяСпособа = СтрокаРабочего.СпособОбработкиПакетовПредставление;
		ИДСпособаОбработки = XmlСтрока(СтрокаРабочего.СпособОбработки);
		
		ИнформацияФЗ = КэшУправляющихФЗ.Получить(СтрокаРабочего.ИдентификаторРодительскогоФЗ);
		Если ИнформацияФЗ = Неопределено Тогда
			ТочкаРодитель = ПолучитьИлиСоздатьТочкуСпособа(Диаграмма, КэшСпособов, ИмяСпособа);
			ЦветИнтервала = Неопределено;
		Иначе
			ТочкаРодитель = ИнформацияФЗ.Точка;
			ЦветИнтервала = ИнформацияФЗ.Цвет;
		КонецЕсли;
		
		НомерДорожки = ОпределитьНомерДорожки(КэшОкончанийДорожек, СтрокаРабочего.СпособОбработки, СтрокаРабочего.ВременнаяМеткаНачало, ДатаОкончания);
		
		ТочкаДорожка = Диаграмма.УстановитьТочку(СтрокаРабочего.СпособОбработки, ТочкаРодитель.Значение);
		ТочкаДорожка.Текст = ИмяСпособа;
		СерияДорожка = Диаграмма.УстановитьСерию(ИДСпособаОбработки + " " + НомерДорожки); 
		СерияДорожка.Текст = Строка(НомерДорожки);
		
		ТекстИнтервала = СтрокаРабочего.ОбработаноПакетов;
		
		ДобавитьИнтервалДиаграммы(Диаграмма, ТочкаДорожка, СерияДорожка, СтрокаРабочего.ВременнаяМеткаНачало, ДатаОкончания, ЦветИнтервала, ТекстИнтервала);
		
	КонецЦикла;
	
	Если МинДатаГанта <> Неопределено Тогда 
		Диаграмма.УстановитьПолныйИнтервал(ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МинДатаГанта) - 10, ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МаксДатаГанта) + 10);
	КонецЕсли;
	
	Диаграмма.Обновление = Истина;
	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИНастроитьДиаграмму(Диаграмма)
	
	Диаграмма.АвтоУстановкаТекстаСерий = Ложь;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	Диаграмма.ОтображатьПустыеЗначения = Ложь;
	Диаграмма.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Градиент;
	Диаграмма.ОтображатьЛегенду = Ложь; 
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.НеОтображать;
	
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы;
	Пока Шкала.Количество() > 1 Цикл
		Шкала.Удалить(Шкала[1]);
	КонецЦикла;
	
	ЭлементЧасы = Шкала.Добавить();
	ЭлементЧасы.Единица = ТипЕдиницыШкалыВремени.Час;
	ЭлементЧасы.Кратность = 1;
	
	ЭлементМинуты = Шкала.Добавить();
	ЭлементМинуты.Единица = ТипЕдиницыШкалыВремени.Минута;
	ЭлементМинуты.Кратность = 1;
	
	ЭлементСекунды = Шкала.Добавить();
	ЭлементСекунды.Единица = ТипЕдиницыШкалыВремени.Секунда;
	ЭлементСекунды.Кратность = 1; 
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляДиаграммы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МеткаНачала",    (НачалоПериода - '00010101000000') * 1000); // ум_ПакетыДанныхОбщегоНазначения.ДатаВМеткуВремениUTC(НачалоПериода)
	Запрос.УстановитьПараметр("МеткаОкончания", (КонецПериода  - '00010101000000') * 1000); // ум_ПакетыДанныхОбщегоНазначения.ДатаВМеткуВремениUTC(КонецПериода)
	Запрос.УстановитьПараметр("СпособОбработки", СпособОбработки);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛогФЗ.ИдентификаторФЗ КАК КлючРабочегоПотока,
	|	ЛогФЗ.Вид КАК ВидФЗ,
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаНачало,
	|	МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаКонец,
	|	ЛогФЗ.СпособОбработкиПакетов КАК СпособОбработки,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЛогФЗ.Событие = ЗНАЧЕНИЕ(Перечисление.ум_ЛогированиеСобытийФЗ.Окончание)
	|					ТОГДА ЛогФЗ.ДанныеСобытия
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК СТРОКА(50))) КАК ДанныеСобытия
	|ПОМЕСТИТЬ ВТУпровляющееФЗ
	|ИЗ
	|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ЛогФЗ
	|ГДЕ
	|	ЛогФЗ.Вид = ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.УпровляющееФЗ)
	|	" + ?(ЗначениеЗаполнено(НачалоПериода), "И ЛогФЗ.ВременнаяМеткаСобытия >= &МеткаНачала", "") + "
	|	" + ?(ЗначениеЗаполнено(КонецПериода), "И ЛогФЗ.ВременнаяМеткаСобытия <= &МеткаОкончания", "") + "
	|	" + ?(ЗначениеЗаполнено(СпособОбработки), "И ЛогФЗ.СпособОбработкиПакетов = &СпособОбработки", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛогФЗ.ИдентификаторФЗ,
	|	ЛогФЗ.Вид,
	|	ЛогФЗ.СпособОбработкиПакетов,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) < МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛогФЗ.ИдентификаторФЗ КАК КлючРабочегоПотока,
	|	ЛогФЗ.Вид КАК ВидФЗ,
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаНачало,
	|	МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаКонец,
	|	ЛогФЗ.СпособОбработкиПакетов КАК СпособОбработки,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЛогФЗ.Событие = ЗНАЧЕНИЕ(Перечисление.ум_ЛогированиеСобытийФЗ.Окончание)
	|					ТОГДА ЛогФЗ.ДанныеСобытия
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК СТРОКА(50))) КАК ДанныеСобытия
	|ИЗ
	|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ЛогФЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУпровляющееФЗ КАК ВТУпровляющееФЗ
	|		ПО ЛогФЗ.ИдентификаторРодительскогоФЗ = ВТУпровляющееФЗ.КлючРабочегоПотока
	|ГДЕ
	|	ЛогФЗ.Вид = ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.РабочееФЗ)
	|	" + ?(ЗначениеЗаполнено(НачалоПериода), "И ЛогФЗ.ВременнаяМеткаСобытия >= &МеткаНачала", "") + "
	|	" + ?(ЗначениеЗаполнено(КонецПериода), "И ЛогФЗ.ВременнаяМеткаСобытия <= &МеткаОкончания", "") + "
	|	" + ?(ЗначениеЗаполнено(СпособОбработки), "И ЛогФЗ.СпособОбработкиПакетов = &СпособОбработки", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛогФЗ.ИдентификаторФЗ,
	|	ЛогФЗ.Вид,
	|	ЛогФЗ.СпособОбработкиПакетов,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) < МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия)";
	
	ТаблицаРабочихФЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаРабочихФЗ.Колонки.Добавить("ОбработаноПакетов",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	Для Каждого СтрокаТаблицы Из ТаблицаРабочихФЗ Цикл 
		ДанныеСобытия = ум_ЛогированиеПакетыДанных.РазобратьДанныеСобытия(СтрокаТаблицы.ДанныеСобытия);
		Если ТипЗнч(ДанныеСобытия) = Тип("Структура") И ДанныеСобытия.Свойство("ОбработаноПакетов") Тогда
			СтрокаТаблицы.ОбработаноПакетов = ДанныеСобытия.ОбработаноПакетов;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРабочихФЗ", ТаблицаРабочихФЗ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.КлючРабочегоПотока КАК КлючРабочегоПотока,
	|	Таблица.ВидФЗ КАК ВидФЗ,
	|	Таблица.ВременнаяМеткаНачало КАК ВременнаяМеткаНачало,
	|	Таблица.ВременнаяМеткаКонец КАК ВременнаяМеткаКонец,
	|	Таблица.СпособОбработки КАК СпособОбработки,
	|	Таблица.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	Таблица.ДанныеСобытия КАК ДанныеСобытия,
	|	Таблица.ОбработаноПакетов КАК ОбработаноПакетов
	|ПОМЕСТИТЬ ВТРабочиеФЗ
	|ИЗ
	|	&ТаблицаРабочихФЗ КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРабочиеФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	СУММА(ВТРабочиеФЗ.ОбработаноПакетов) КАК ОбработаноПакетов
	|ПОМЕСТИТЬ ВТОбработаноПакетов
	|ИЗ
	|	ВТРабочиеФЗ КАК ВТРабочиеФЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРабочиеФЗ.ИдентификаторРодительскогоФЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛогФЗ.ИдентификаторФЗ КАК КлючРабочегоПотока,
	|	ЛогФЗ.Вид КАК ВидФЗ,
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаНачало,
	|	МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаКонец,
	|	ЛогФЗ.СпособОбработкиПакетов КАК СпособОбработки,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЛогФЗ.Событие = ЗНАЧЕНИЕ(Перечисление.ум_ЛогированиеСобытийФЗ.Окончание)
	|					ТОГДА ЛогФЗ.ДанныеСобытия
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК СТРОКА(50))) КАК ДанныеСобытия,
	|	ВТУпровляющееФЗ.КлючРабочегоПотока ЕСТЬ NULL КАК ЭтоПустоеРЗ
	|ПОМЕСТИТЬ ВТРегламентныеЗадания
	|ИЗ
	|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ЛогФЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУпровляющееФЗ КАК ВТУпровляющееФЗ
	|		ПО ЛогФЗ.ИдентификаторФЗ = ВТУпровляющееФЗ.ИдентификаторРодительскогоФЗ
	|ГДЕ
	|	ЛогФЗ.Вид = ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеОбработкаПакетов)
	|	" + ?(ЗначениеЗаполнено(НачалоПериода), "И ЛогФЗ.ВременнаяМеткаСобытия >= &МеткаНачала", "") + "
	|	" + ?(ЗначениеЗаполнено(КонецПериода), "И ЛогФЗ.ВременнаяМеткаСобытия <= &МеткаОкончания", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛогФЗ.ИдентификаторФЗ,
	|	ЛогФЗ.Вид,
	|	ЛогФЗ.СпособОбработкиПакетов,
	|	ЛогФЗ.ИдентификаторРодительскогоФЗ,
	|	ВТУпровляющееФЗ.КлючРабочегоПотока ЕСТЬ NULL
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) < МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.КлючРабочегоПотока КАК КлючРабочегоПотока,
	|	ВложенныйЗапрос.ВидФЗ КАК ВидФЗ,
	|	ВложенныйЗапрос.ВременнаяМеткаНачало КАК ВременнаяМеткаНачало,
	|	ВложенныйЗапрос.ВременнаяМеткаКонец КАК ВременнаяМеткаКонец,
	|	ВложенныйЗапрос.СпособОбработки КАК СпособОбработки,
	|	ВложенныйЗапрос.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|	ВложенныйЗапрос.ДанныеСобытия КАК ДанныеСобытия,
	|	ВложенныйЗапрос.СпособОбработки.Представление КАК СпособОбработкиПакетовПредставление,
	|	ВложенныйЗапрос.ЭтоПустоеРЗ КАК ЭтоПустоеРЗ,
	|	ВложенныйЗапрос.ОбработаноПакетов КАК ОбработаноПакетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТУпровляющееФЗ.КлючРабочегоПотока КАК КлючРабочегоПотока,
	|		ВТУпровляющееФЗ.ВидФЗ КАК ВидФЗ,
	|		ВТУпровляющееФЗ.ВременнаяМеткаНачало КАК ВременнаяМеткаНачало,
	|		ВТУпровляющееФЗ.ВременнаяМеткаКонец КАК ВременнаяМеткаКонец,
	|		ВТУпровляющееФЗ.СпособОбработки КАК СпособОбработки,
	|		ВТУпровляющееФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
	|		ВТУпровляющееФЗ.ДанныеСобытия КАК ДанныеСобытия,
	|		ЛОЖЬ КАК ЭтоПустоеРЗ,
	|		ЕСТЬNULL(ВТОбработаноПакетов.ОбработаноПакетов, 0) КАК ОбработаноПакетов
	|	ИЗ
	|		ВТУпровляющееФЗ КАК ВТУпровляющееФЗ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбработаноПакетов КАК ВТОбработаноПакетов
	|			ПО ВТУпровляющееФЗ.КлючРабочегоПотока = ВТОбработаноПакетов.ИдентификаторРодительскогоФЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТРегламентныеЗадания.КлючРабочегоПотока,
	|		ВТРегламентныеЗадания.ВидФЗ,
	|		ВТРегламентныеЗадания.ВременнаяМеткаНачало,
	|		ВТРегламентныеЗадания.ВременнаяМеткаКонец,
	|		ВТРегламентныеЗадания.СпособОбработки,
	|		ВТРегламентныеЗадания.ИдентификаторРодительскогоФЗ,
	|		ВТРегламентныеЗадания.ДанныеСобытия,
	|		ВТРегламентныеЗадания.ЭтоПустоеРЗ,
	|		0
	|	ИЗ
	|		ВТРегламентныеЗадания КАК ВТРегламентныеЗадания
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТРабочиеФЗ.КлючРабочегоПотока,
	|		ВТРабочиеФЗ.ВидФЗ,
	|		ВТРабочиеФЗ.ВременнаяМеткаНачало,
	|		ВТРабочиеФЗ.ВременнаяМеткаКонец,
	|		ВТРабочиеФЗ.СпособОбработки,
	|		ВТРабочиеФЗ.ИдентификаторРодительскогоФЗ,
	|		ВТРабочиеФЗ.ДанныеСобытия,
	|		ЛОЖЬ,
	|		ВТРабочиеФЗ.ОбработаноПакетов
	|	ИЗ
	|		ВТРабочиеФЗ КАК ВТРабочиеФЗ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяМеткаНачало,
	|	ИдентификаторРодительскогоФЗ";
	
	ДанныеДляДиаграммы = Запрос.Выполнить().Выгрузить();
	
	МенеджерВременныхТаблиц.Закрыть();
	
	Возврат ДанныеДляДиаграммы;
	
КонецФункции

&НаСервере
Процедура ОбновитьГраницыВремени(СтрокаДанных, МинДатаГанта, МаксДатаГанта, ДатаОкончания)
	
	Если МинДатаГанта = Неопределено Тогда
		МинДатаГанта = СтрокаДанных.ВременнаяМеткаНачало;
	Иначе
		МинДатаГанта = Мин(МинДатаГанта, СтрокаДанных.ВременнаяМеткаНачало);
	КонецЕсли;
	
	МаксДатаГанта = Макс(МаксДатаГанта, СтрокаДанных.ВременнаяМеткаКонец);
	
	ДатаОкончания = СтрокаДанных.ВременнаяМеткаКонец;
	Если СтрокаДанных.ВременнаяМеткаНачало = ДатаОкончания Тогда
		ДатаОкончания = СтрокаДанных.ВременнаяМеткаНачало + 1000;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИлиСоздатьТочкуСпособа(Диаграмма, КэшСпособов, ИмяСпособа)
	
	ТочкаСпособ = КэшСпособов.Получить(ИмяСпособа);
	Если ТочкаСпособ = Неопределено Тогда
		ТочкаСпособ = Диаграмма.УстановитьТочку(ИмяСпособа,); 
		КэшСпособов.Вставить(ИмяСпособа, ТочкаСпособ);
	КонецЕсли;
	
	Возврат ТочкаСпособ;
	
КонецФункции

&НаСервере
Функция ОпределитьНомерДорожки(КэшОкончанийДорожек, СпособОбработки, ВременнаяМеткаНачало, ДатаОкончания)
	
	МассивОкончаний = КэшОкончанийДорожек.Получить(СпособОбработки);
	Если МассивОкончаний = Неопределено Тогда
		МассивОкончаний = Новый Массив;
		КэшОкончанийДорожек.Вставить(СпособОбработки, МассивОкончаний);
	КонецЕсли;
	
	Для Индекс = 0 По МассивОкончаний.ВГраница() Цикл
		Если МассивОкончаний[Индекс] <= ВременнаяМеткаНачало Тогда
			МассивОкончаний[Индекс] = ДатаОкончания;
			Возврат Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	МассивОкончаний.Добавить(ДатаОкончания);
	Возврат МассивОкончаний.Количество();
	
КонецФункции

&НаСервере
Процедура ДобавитьИнтервалДиаграммы(Диаграмма, Точка, Серия, МеткаНачала, МеткаОкончания, Цвет = Неопределено, Текст = "")
	
	ЗначениеГанта = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Если Серия.Значение = "Управляющее ФЗ" ИЛИ Серия.Значение = "Регламентные задания" Тогда
		ЗначениеГанта.Текст = Точка.Текст;
	Иначе
		ЗначениеГанта.Текст = "Поток " + Серия.Текст;
	КонецЕсли;
	Интервал = ЗначениеГанта.Добавить();
	Интервал.Начало = ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МеткаНачала);
	Интервал.Конец  = ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МеткаОкончания);
	
	Если Цвет <> Неопределено Тогда
		Интервал.Цвет = Цвет;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Текст) Тогда
		Интервал.Текст = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦветаИнтервала()
	
	Цвета = Новый Массив;
	Цвета.Добавить(WebЦвета.Красный);
	Цвета.Добавить(WebЦвета.Оранжевый);
	Цвета.Добавить(WebЦвета.ЖелтоЗеленый);
	Цвета.Добавить(WebЦвета.Зеленый);
	Цвета.Добавить(WebЦвета.Голубой);
	Цвета.Добавить(WebЦвета.Синий);
	Цвета.Добавить(WebЦвета.Фиолетовый);
	
	Возврат Цвета;
	
КонецФункции

#КонецОбласти
