////////////////////////////////////////////////////////////////////////////////
// <Модуль менеджера - Справочник.ум_ОписанияОшибокОбработкиПакетов.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ИнициализацияПредопределенныхЭлементовОписанияОшибокОбработкиПакетов() Экспорт
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонтрольРабочихФЗ_ЗавершеноАварийноРабочееФЗ;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();     
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонтрольРабочихФЗ_ЗавершеноРабочееФЗ;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
		
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонтрольРабочихФЗ_НеНайденоРабочеФЗ;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонтрольРабочихФЗ_ОтмененоПросроченноеРабочееФЗ;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонтрольРабочихФЗ_ОтмененоРабочееФЗ;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.КонфликтБлокировокПриВыполненииТранзакции;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.НеустранимыйКонфликтБлокировок;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.ОшибкаПриВызовеМетодаКонтекстаЗаблокировать;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
	ОписанияОшибок = Справочники.ум_ОписанияОшибокОбработкиПакетов.ПревышеноМаксимальноеВремяОжиданияПредоставленияБлокировки;
	ОбъектОписанияОшибок = ОписанияОшибок.ПолучитьОбъект();
	ОбъектОписанияОшибок.ВключитьВОбщийСписокОшибок = Истина;
	ОбъектОписанияОшибок.Записать();
	
КонецПроцедуры // ИнициализацияПредопределенныхЭлементовОписанияОшибокОбработкиПакетов()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыСпособаОбработкиПакетовПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Активность", Истина);
	Результат.Вставить("КоличествоРабочихФЗ", 5);
	Результат.Вставить("КоличествоПакетовНаРабочееФЗ", 1);
	Результат.Вставить("КоличествоПопытокОбработкиПакета", 10);
	Результат.Вставить("ВремяЖизниУправляющегоФЗ", 60);
	Результат.Вставить("ТаймаутПовторнойОбработкиПакета", 120);
	Результат.Вставить("ПовторнаяОбработкаПакетовСОшибками", Истина);
	Результат.Вставить("УдалятьПакетПриУспешнойОбработке", Истина);
	Результат.Вставить("ТаймаутУдаленияПакета", 24);
	Результат.Вставить("ИспользоватьОбщийСписокОшибок", Истина);
	Результат.Вставить("КоличествоПакетовНаУправляющееФЗ", 0);
		
	Возврат Результат;
	
КонецФункции // ПараметрыСпособаОбработкиПакетовПоУмолчанию()

Процедура ЗаполнитьПараметрыСпособаОбработкиПакетов(СпособОбработки, Параметры)
	
	СпособОбъект = СпособОбработки.ПолучитьОбъект();
	Если СпособОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СпособОбъект, Параметры);
	СпособОбъект.Записать();
	
КонецПроцедуры // ЗаполнитьПараметрыСпособаОбработкиПакетов()

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
